tap "0ihsan/packages"
tap "gromgit/fuse"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jayadamsmorgan/yatoro"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "stripe/stripe-cli"
tap "supabase/tap"
brew "act"
brew "libtiff"
brew "jpeg-xl"
brew "ast-grep"
brew "bat"
brew "bfg"
brew "btop"
brew "cocoapods"
brew "php", link: false
brew "composer"
brew "deno"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "goaccess"
brew "httpd"
brew "httpie"
brew "ical-buddy"
brew "jq"
brew "lazygit"
brew "lnav"
brew "lynx"
brew "mailhog"
brew "multitail"
brew "mysql", restart_service: :changed
brew "neovim"
brew "php-code-sniffer"
brew "php@8.3", link: true
brew "pipx"
brew "postgresql@14"
brew "python@3.10"
brew "python@3.12"
brew "reattach-to-user-namespace"
brew "repomix"
brew "ripgrep"
brew "starship"
brew "stow"
brew "subversion"
brew "tlrc"
brew "tmux"
brew "tree"
brew "uv"
brew "verovio"
brew "w3m"
brew "wget"
brew "zoxide"
brew "zsh-completions"
brew "zsh-vi-mode"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
cask "clickup"
cask "docker-desktop"
cask "ghostty"
cask "karabiner-elements"
cask "kitty"
cask "microsoft-edge"
cask "obsidian"
cask "ollama-app"
cask "shortcat"
cask "virtualbox"
vscode "aaron-bond.better-comments"
vscode "ambar.bundle-size"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "azemoh.one-monokai"
vscode "benjaminzekavica.wordpress-gutenberg-snippets"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "co6x0.vscode-wp-block-html"
vscode "codeium.codeium"
vscode "dbaeumer.vscode-eslint"
vscode "deinsoftware.vitest-snippets"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "ducfilan.pug-formatter"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "humy2833.ftp-simple"
vscode "johnbillion.vscode-wordpress-hooks"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "kvnol.mjml-snippets"
vscode "lukasz-wronski.ftp-sync"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "million.million-lint"
vscode "mjmlio.vscode-mjml"
vscode "mkxml.vscode-filesize"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-pugbeautify"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "natizyskunk.sftp"
vscode "naumovs.color-highlight"
vscode "neilbrayfield.php-docblocker"
vscode "patbenatar.advanced-new-file"
vscode "persoderlind.vscode-phpcbf"
vscode "rexshi.phpdoc-comment-vscode-plugin"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "simonsiefke.svg-preview"
vscode "sleistner.vscode-fileutils"
vscode "ucsoftware.css-organizer"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wongjn.php-sniffer"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "ziishaned.livereload"
cargo "rustlings"
